<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"08ee68f91545f99fe72f109a78e29817fe6c9bb2b09ca8f6289e228d599b8aff","plan_job_ref":"Job Environment Main - Plan #44 at https://github.com/jarrod-lowe/wildsea/actions/runs/10337829150","plan_out_hash":"801289fda6cc252428ab0c834e36ce78c6161fb9cd2bfbf640ac9d6c5644e401","plan_hash":"9bd55b52b98decdcdade51b568c483d5f235b1930a437e48d35823fabaea5031","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # aws_dynamodb_table.table will be destroyed
  # (because aws_dynamodb_table.table is not in configuration)
-   resource "aws_dynamodb_table" "table" {
-       arn                         = "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary" -> null
-       billing_mode                = "PAY_PER_REQUEST" -> null
-       deletion_protection_enabled = true -> null
-       hash_key                    = "PK" -> null
-       id                          = "Wildsea-primary" -> null
-       name                        = "Wildsea-primary" -> null
-       range_key                   = "SK" -> null
-       read_capacity               = 0 -> null
-       stream_enabled              = false -> null
-       table_class                 = "STANDARD" -> null
-       tags                        = {
-           "Name" = "Wildsea-primary"
        } -> null
-       tags_all                    = {
-           "Application" = "Wildsea-primary"
-           "Name"        = "Wildsea-primary"
        } -> null
-       write_capacity              = 0 -> null
#        (3 unchanged attributes hidden)

-       attribute {
-           name = "PK" -> null
-           type = "S" -> null
        }
-       attribute {
-           name = "SK" -> null
-           type = "S" -> null
        }

-       point_in_time_recovery {
-           enabled = true -> null
        }

-       ttl {
-           enabled        = false -> null
#            (1 unchanged attribute hidden)
        }
    }

  # module.wildsea.aws_dynamodb_table.table will be created
+   resource "aws_dynamodb_table" "table" {
+       arn                         = (known after apply)
+       billing_mode                = "PAY_PER_REQUEST"
+       deletion_protection_enabled = true
+       hash_key                    = "**"
+       id                          = (known after apply)
+       name                        = "Wildsea-primary"
+       range_key                   = "**"
+       read_capacity               = (known after apply)
+       stream_arn                  = (known after apply)
+       stream_label                = (known after apply)
+       stream_view_type            = (known after apply)
+       tags                        = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all                    = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
+       write_capacity              = (known after apply)

+       attribute {
+           name = "PK"
+           type = "S"
        }
+       attribute {
+           name = "SK"
+           type = "S"
        }

+       point_in_time_recovery {
+           enabled = true
        }

+       server_side_encryption (known after apply)

+       ttl (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #44](https://github.com/jarrod-lowe/wildsea/actions/runs/10337829150)